# Pandas

1. Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool.
2. It is built on top of the Python programming language.
3. It aims to be the fundamental high-level building block for doing practical, real-world data analysis in Python

It has three types of data structure
1. Series(1 Dimensional)
2. DataFrame(2 Dimensional)
3. Panel(Multi dimensional)

## Working

In [2]:
import pandas as pd

#### *Working with series*

In [3]:
a=[1,2,3,5]
pd.Series(a)

0    1
1    2
2    3
3    5
dtype: int64

In [5]:
#To change index 
pd.Series(a,index=['a','b','c','d'])

a    1
b    2
c    3
d    5
dtype: int64

In [8]:
import numpy as np

In [10]:
#To create series using array
a=np.array([1,2,5])
pd.Series(a)

0    1
1    2
2    5
dtype: int32

In [12]:
d={'Name':'Rahul','Marks':12,'Result':'Fail'}
pd.Series(d)

Name      Rahul
Marks        12
Result     Fail
dtype: object

In [21]:
pd.Series(a).head(2)

0    1
1    2
dtype: int32

In [23]:
pd.Series(a).tail(2)

1    2
2    5
dtype: int32

In [25]:
pd.Series(a).values

array([1, 2, 5])

In [26]:
pd.Series(a).array

<PandasArray>
[1, 2, 5]
Length: 3, dtype: int32

#### *Working with Dataframe*

In [7]:
t={'Name':['Narendra','Rahul'],'Roll no.':[1,2],'Marks':[254,12]}
pd.DataFrame(t)

       Name  Roll no.  Marks
0  Narendra         1    254
1     Rahul         2     12

In [16]:
o={'Name':['a','b','c','d','e'],'Marks':[65,78,94,80,71]}
m=pd.DataFrame(o)
print(m)

  Name  Marks
0    a     65
1    b     78
2    c     94
3    d     80
4    e     71

In [19]:
m.describe() #Function to get satistical data.

           Marks
count   5.000000
mean   77.600000
std    10.922454
min    65.000000
25%    71.000000
50%    78.000000
75%    80.000000
max    94.000000

In [27]:
m['Name']

0    a
1    b
2    c
3    d
4    e
Name: Name, dtype: object

In [29]:
m.loc[2]

Name      c
Marks    94
Name: 2, dtype: object

In [30]:
m.columns

Index(['Name', 'Marks'], dtype='object')

In [31]:
m.shape

(5, 2)

In [32]:
m['Name'].head(2)

0    a
1    b
Name: Name, dtype: object

In [33]:
m[1:5:2]

  Name  Marks
1    b     78
3    d     80